docs/nb5/raw/phase0-k6-n10000-nosearch-warm2.txt


  █ THRESHOLDS 

    http_req_duration{qtype:T1_TITLE}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_duration{qtype:T2_CONDITION}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_duration{qtype:T3_MOOD}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_duration{qtype:T4_SELLER}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2206    73.364452/s
    checks_succeeded...: 100.00% 2206 out of 2206
    checks_failed......: 0.00%   0 out of 2206

    ✓ status 200

    HTTP
    http_req_duration..............: avg=35.15ms  min=14.6ms   med=33.56ms  p(90)=44.99ms p(95)=49.37ms  max=114.39ms
      { expected_response:true }...: avg=35.15ms  min=14.6ms   med=33.56ms  p(90)=44.99ms p(95)=49.37ms  max=114.39ms
      { qtype:T1_TITLE }...........: avg=0s       min=0s       med=0s       p(90)=0s      p(95)=0s       max=0s      
      { qtype:T2_CONDITION }.......: avg=0s       min=0s       med=0s       p(90)=0s      p(95)=0s       max=0s      
      { qtype:T3_MOOD }............: avg=0s       min=0s       med=0s       p(90)=0s      p(95)=0s       max=0s      
      { qtype:T4_SELLER }..........: avg=0s       min=0s       med=0s       p(90)=0s      p(95)=0s       max=0s      
    http_req_failed................: 0.00%  0 out of 2206
    http_reqs......................: 2206   73.364452/s

    EXECUTION
    iteration_duration.............: avg=136.22ms min=115.06ms med=134.44ms p(90)=146.2ms p(95)=151.25ms max=215.22ms
    iterations.....................: 2206   73.364452/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 14 MB  461 kB/s
    data_sent......................: 223 kB 7.4 kB/s