docs/nb5/raw/phase0-k6-n10000-search-cold.txt


  █ THRESHOLDS 

    http_req_duration{qtype:T1_TITLE}
    ✓ 'p(90)<60000' p(90)=73.68ms

    http_req_duration{qtype:T2_CONDITION}
    ✓ 'p(90)<60000' p(90)=54.86ms

    http_req_duration{qtype:T3_MOOD}
    ✓ 'p(90)<60000' p(90)=66.9ms

    http_req_duration{qtype:T4_SELLER}
    ✓ 'p(90)<60000' p(90)=74.84ms

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1985    65.894616/s
    checks_succeeded...: 100.00% 1985 out of 1985
    checks_failed......: 0.00%   0 out of 1985

    ✓ status 200

    HTTP
    http_req_duration..............: avg=50.62ms  min=13.18ms  med=52.13ms  p(90)=70.18ms  p(95)=75.36ms  max=107.81ms
      { expected_response:true }...: avg=50.62ms  min=13.18ms  med=52.13ms  p(90)=70.18ms  p(95)=75.36ms  max=107.81ms
      { qtype:T1_TITLE }...........: avg=58.08ms  min=21.46ms  med=58.81ms  p(90)=73.68ms  p(95)=77.44ms  max=105ms   
      { qtype:T2_CONDITION }.......: avg=34.22ms  min=13.18ms  med=30.49ms  p(90)=54.86ms  p(95)=61.54ms  max=81ms    
      { qtype:T3_MOOD }............: avg=49.24ms  min=19.28ms  med=48.82ms  p(90)=66.9ms   p(95)=70.85ms  max=102.3ms 
      { qtype:T4_SELLER }..........: avg=60.3ms   min=34.62ms  med=59.34ms  p(90)=74.84ms  p(95)=79.82ms  max=107.81ms
    http_req_failed................: 0.00%  0 out of 1985
    http_reqs......................: 1985   65.894616/s

    EXECUTION
    iteration_duration.............: avg=151.59ms min=113.18ms med=153.06ms p(90)=171.34ms p(95)=176.69ms max=234.73ms
    iterations.....................: 1985   65.894616/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 6.9 MB 229 kB/s
    data_sent......................: 279 kB 9.3 kB/s