docs/nb5/raw/phase5-k6-es-nosearch-cold.txt


  █ THRESHOLDS 

    http_req_duration{qtype:T1_TITLE}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_duration{qtype:T2_CONDITION}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_duration{qtype:T3_MOOD}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_duration{qtype:T4_SELLER}
    ✓ 'p(90)<60000' p(90)=0s

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2540    84.589389/s
    checks_succeeded...: 100.00% 2540 out of 2540
    checks_failed......: 0.00%   0 out of 2540

    ✓ status 200

    HTTP
    http_req_duration..............: avg=17.69ms min=11.82ms  med=17.21ms  p(90)=19.31ms  p(95)=20.09ms max=110.32ms
      { expected_response:true }...: avg=17.69ms min=11.82ms  med=17.21ms  p(90)=19.31ms  p(95)=20.09ms max=110.32ms
      { qtype:T1_TITLE }...........: avg=0s      min=0s       med=0s       p(90)=0s       p(95)=0s      max=0s      
      { qtype:T2_CONDITION }.......: avg=0s      min=0s       med=0s       p(90)=0s       p(95)=0s      max=0s      
      { qtype:T3_MOOD }............: avg=0s      min=0s       med=0s       p(90)=0s       p(95)=0s      max=0s      
      { qtype:T4_SELLER }..........: avg=0s      min=0s       med=0s       p(90)=0s       p(95)=0s      max=0s      
    http_req_failed................: 0.00%  0 out of 2540
    http_reqs......................: 2540   84.589389/s

    EXECUTION
    iteration_duration.............: avg=118.2ms min=113.76ms med=117.65ms p(90)=119.83ms p(95)=120.6ms max=221.28ms
    iterations.....................: 2540   84.589389/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 16 MB  531 kB/s
    data_sent......................: 257 kB 8.5 kB/s